jonathangray/openbsd-X11/xc/programs/kx/rxtelnet.man
.\" $Id: rxtelnet.man,v 1.1 1998/03/25 14:48:59 art Exp $
.\"
.Dd September 27, 1996
.Dt RXTELNET 1
.Os KTH_KRB
.Sh NAME
.Nm rxtelnet
.Nd
start a telnet and forward X-connections.
.Sh SYNOPSIS
.Nm rxtelnet
.Op Fl l Ar username
.Op Fl k	
.Op Fl t Ar telnet_args
.Op Fl x Ar xterm_args
.Op Fl w Ar term_emulator
.Ar host
.Op Ar port
.Sh DESCRIPTION
The
.Nm
program starts a
.Nm xterm
window with a telnet to host
.Ar host .
From this window you will also be able to run X clients that will be
able to connect securily to your X server. If
.Ar port
is given, that port will be used instead of the default.
.Pp
The supported options are:
.Bl -tag -width Ds
.It Fl l
Log in on the remote host as user
.Ar username
.It Fl k
Disables keep-alives
.It Fl t
Send
.Ar telnet_args
as arguments to
.Nm telnet
.It Fl x
Send
.Ar xterm_args
as arguments to
.Nm xterm
.It Fl w
Use
.Ar term_emulator
instead of xterm.
.El
.Sh EXAMPLE
To login from host
.Va foo
(where your display is)
to host
.Va bar ,
you might do the following.
.Bl -enum
.It
On foo: 
.Nm
.Va bar
.It
You will get a new window with a
.Nm telnet
to
.Va bar .
In this window you will be able to start X clients.
.El
.Sh SEE ALSO
.Xr rxterm 1 ,
.Xr tenletxr 1 ,
.Xr kx 1 ,
.Xr kxd 8 ,
.Xr telnet 1
